class CityEnum
	def self.baoding
		[
			'涞源县环保局',
			'清苑县政府',
			'阜平县环保局',
			'涿州监测站',
			'涞水县环境监测站',
			'易县环境保护局',
			'白沟新城行政中心楼',
			'雄县环境保护局',
			'顺平县环保局',
			'曲阳县环保局',
			'地表水厂',
			'游泳馆',
			'接待中心',
			'华电二区',
			'徐水环保局',
			'定兴县政府',
			'唐县政府楼',
			'博野县招生办',
			'安国市政府',
			'蠡县县政府',
			'定州武装部',
			'望都县环境监测站',
			'容城县环境保护局',
			'高阳县环保局',
			'安新民政局',
			'市监测站',
			'高碑店环保局',
			'胶片厂',
			'满城税务局'
		]
	end
	def self.langfang
		[
			'三河市','安次区','广阳区','大厂','霸州市','香河县','永清县','文安县','固安县','大城县','廊坊开发区'
		]
	end
	def self.jjj
		[
			'北京','天津','衡水市','邯郸市','石家庄市','邢台市','唐山市','廊坊市','保定市','承德市','沧州市','秦皇岛市','张家口市'
		]
	end
	def self.china_city_74
		[
			'廊坊市',	
			'嘉兴市',
			'广州市',
			'肇庆市',
			'佛山市', 
			'郑州市', 
			'东莞市', 
			'湖州市', 
			'济南市', 
			'邯郸市', 
			'金华市', 
			'重庆市', 
			'长沙市', 
			'江门市', 
			'武汉市', 
			'杭州市', 
			'南宁市', 
			'苏州市', 
			'无锡市', 
			'常州市', 
			'南昌市', 
			'合肥市', 
			'衢州市', 
			'镇江市', 
			'衡水市', 
			'连云港市',
			'惠州市', 
			'南京市', 
			'宿迁市', 
			'丽水市', 
			'深圳市', 
			'青岛市', 
			'扬州市', 
			'徐州市', 
			'中山市', 
			'福州市',	
			'哈尔滨市',	
			'乌鲁木齐市',
			'绍兴市',	
			'拉萨市',	
			'温州市',	
			'上海',	
			'台州市',	
			'兰州市',	
			'舟山市',	
			'长春市',	
			'宁波市',	
			'淮安市',	
			'太原市',	
			'秦皇岛市',	
			'厦门市',	
			'珠海市',	
			'泰州市',	
			'大连市',	
			'海口市',	
			'昆明市',	
			'唐山市',	
			'沧州市',	
			'承德市',	
			'邢台市',	
			'南通市',	
			'盐城市',	
			'西宁市',	
			'沈阳市',	
			'张家口市',	
			'保定市',	
			'天津',	
			'贵阳市',	
			'银川市',	
			'西安市',	
			'呼和浩特市',
			'石家庄市',
			'北京',
			'成都市'
		]
	end
	def self.city_short(city_name)
		hs=Hash.new
		hs['海西州'] = '海西蒙古族藏族自治州'
		hs['临夏州'] = '临夏回族自治州'
		hs['阿坝州'] = '阿坝藏族羌族自治州'
		hs['伊犁哈萨克州'] = '伊犁哈萨克自治州'
		hs['克孜勒苏州'] = '克孜勒苏柯尔克孜自治州'
		hs['凉山州'] = '凉山彝族自治州'
		hs['博州'] = '博尔塔拉蒙古自治州'
		hs['大理州'] = '大理白族自治州'
		hs['延边州'] = '延边朝鲜族自治州'
		hs['德宏州'] = '德宏傣族景颇族自治州'
		hs['怒江州'] = '怒江傈僳族自治州' 
		hs['恩施州'] = '恩施土家族苗族自治州'
		hs['文山州'] = '文山壮族苗族自治州'
		hs['昌吉州'] = '昌吉回族自治州'
		hs['果洛州'] = '果洛藏族自治州'
		hs['楚雄州'] = '楚雄彝族自治州'
		hs['毕节'] = '毕节地区'
		hs['海北州'] = '海北藏族自治州'
		hs['海南州'] = '海南藏族自治州'
		hs['湘西州'] = '湘西土家族苗族自治州'
		hs['玉树州'] = '玉树藏族自治州'
		hs['甘南州'] = '甘南藏族自治州'
		hs['甘孜州'] = '甘孜藏族自治州'
		hs['红河州'] = '红河哈尼族彝族自治州'
		hs['西双版纳州'] = '西双版纳傣族自治州'
		hs['迪庆州'] = '迪庆藏族自治州'
		hs['黄南州'] = '黄南藏族自治州'
		hs['黔东南州'] = '黔东南苗族侗族自治州'
		hs['黔南州'] = '黔南布依族苗族自治州'
		hs['黔西南州'] = '黔西南布依族苗族自治州'
		hs[city_name]
	end
	def self.full_name(city_name)
		hs=Hash.new
		hs['海西蒙古族藏族自治州'] = '海西州'
		hs['临夏回族自治州'] = '临夏州'
		hs['阿坝藏族羌族自治州'] = '阿坝州'
		hs['伊犁哈萨克自治州'] = '伊犁哈萨克州'
		hs['克孜勒苏柯尔克孜自治州'] = '克孜勒苏州'
		hs['凉山彝族自治州'] = '凉山州'
		hs['博尔塔拉蒙古自治州'] = '博州'
		hs['大理白族自治州'] = '大理州'
		hs['延边朝鲜族自治州'] = '延边州'
		hs['德宏傣族景颇族自治州'] = '德宏州'
		hs['怒江傈僳族自治州'] = '怒江州'
		hs['恩施土家族苗族自治州'] = '恩施州'
		hs['文山壮族苗族自治州'] = '文山州'
		hs['昌吉回族自治州'] = '昌吉州'
		hs['果洛藏族自治州'] = '果洛州'
		hs['楚雄彝族自治州'] = '楚雄州'
		hs['毕节地区'] = '毕节'
		hs['海北藏族自治州'] = '海北州'
		hs['海南藏族自治州'] = '海南州'
		hs['湘西土家族苗族自治州'] = '湘西州'
		hs['玉树藏族自治州'] = '玉树州'
		hs['甘南藏族自治州'] = '甘南州'
		hs['甘孜藏族自治州'] = '甘孜州'
		hs['红河哈尼族彝族自治州'] = '红河州'
		hs['西双版纳傣族自治州'] = '西双版纳州'
		hs['迪庆藏族自治州'] = '迪庆州'
		hs['黄南藏族自治州'] = '黄南州'
		hs['黔东南苗族侗族自治州'] = '黔东南州'
		hs['黔南布依族苗族自治州'] = '黔南州'
		hs['黔西南布依族苗族自治州'] = '黔西南州'
		hs[city_name]
	end
end
